boards-api/app/controllers/api/v1/boards_controller.rb

  def index
    @boards = Board.order("created_at DESC")
---
SELECT "boards".* FROM "boards" ORDER BY created_at DESC

  def create
    @board = Board.create!(board_param.merge({link: SecureRandom.alphanumeric(10)}))
---
INSERT INTO "boards" ("title", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["link", "b7fMQKXnaP"], ["created_at", "2022-02-19 13:23:17.765445"], ["updated_at", "2022-02-19 13:23:17.765445"]]

  def show
    @board = Board.find_by(link: params[:link])
---
SELECT "boards".* FROM "boards" WHERE "boards"."link" = $1 LIMIT $2  [["link", "MyString"], ["LIMIT", 1]]

  def destroy
    @board = Board.find(params[:id])
    @board.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 298486374]]