boards-api/app/controllers/api/v1/board_columns_controller.rb

    def index
        if params[:board_id]
            @columns = BoardColumn.where(:board_id => params[:board_id])
          else
            @columns = BoardColumn.all
---
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."board_id" = $1  [["board_id", 298486374]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]

    def create
      columns = BoardColumn.where(board_id: column_params[:board_id])
      if columns.any?
---
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."board_id" = $1  [["board_id", 298486374]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT 1 AS one FROM "board_columns" WHERE "board_columns"."board_id" = $1 LIMIT $2  [["board_id", 1], ["LIMIT", 1]]