boards-api/app/controllers/api/v1/cards_controller.rb

    def index
        if params[:board_column_id]
            @cards = Card.where(:board_column_id => params[:board_column_id])
          else
            @cards = Card.all
---
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
SELECT "cards".* FROM "cards"

    def create
        cards = Card.where(board_column_id: card_params[:board_column_id])
        if cards.any?
---
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
SELECT "cards".* FROM "cards" ORDER BY "cards"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "cards" WHERE "cards"."board_column_id" = $1 LIMIT $2  [["board_column_id", 298486374], ["LIMIT", 1]]

    def update
        @card = Card.find(params[:id])
        @card.update(card_params)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
UPDATE "cards" SET "position" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["position", 0], ["updated_at", "2022-02-20 09:12:10.474153"], ["id", 51848956]]

    def move
      card = Card.find(params[:id])
      cards = Card.where(board_column_id: card_params[:board_column_id])
      card_replace = cards.where(position: card_params[:position])
      position_to_replace = card.position
      sorted_cards = cards.sort_by { |card| card.position }
      last_position = sorted_cards.last.position
      if ((card.position > card_params[:position]) && (card.position != 0)) ||
        ((card.position < card_params[:position]) && last_position != card.position)
        card_replace = card_replace.update(position: position_to_replace)
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
UPDATE "cards" SET "board_column_id" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["board_column_id", 309456473], ["updated_at", "2022-02-19 16:33:29.569018"], ["id", 113629430]]

    def move_left
      ourcard = Card.find(params[:id])
      columns = BoardColumn.all
      column = ourcard.board_column
      ourcolumns = columns.where(board_id: column.board_id)
      column_position = column.position
      target_position = column_position - 1
      if (column.position > 0)
        target_column = ourcolumns.where(position: target_position)[0]
        target_column_id = target_column.id
        target_cards = Card.where(board_column_id: target_column_id)
        our_cards = Card.where(board_column_id: ourcard.board_column_id)
        if target_cards.any?
          max_target_cards_position = target_cards.sort_by { |card| card.position }.last.position
        else
          max_target_cards_position = -1
        end
        if (max_target_cards_position < ourcard.position)
          sorted_our_cards = our_cards.find_all{|card| card.position > ourcard.position}
          sorted_our_cards.map{|card| card.update(position: card.position - 1)}
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."board_id" = $1  [["board_id", 298486374]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
SELECT "cards".* FROM "cards"
SELECT 1 AS one FROM "cards" WHERE "cards"."board_column_id" = $1 LIMIT $2  [["board_column_id", 298486374], ["LIMIT", 1]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
UPDATE "cards" SET "title" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["title", "test"], ["updated_at", "2022-02-19 15:41:13.288179"], ["id", 298486374]]

    def move_right
      ourcard = Card.find(params[:id])
      columns = BoardColumn.all
      column = ourcard.board_column
      ourcolumns = columns.where(board_id: column.board_id)
      sorted_columns = ourcolumns.sort_by{|board_column| board_column.position}
      last_columns_position = sorted_columns.last.position
      column_position = column.position
      if (column.position < last_columns_position)
        target_column = ourcolumns.where(position: column_position + 1)[0]
        target_column_id = target_column.id
        target_cards = Card.where(board_column_id: target_column_id)
        our_cards = Card.where(board_column_id: ourcard.board_column_id)
        if target_cards.any?
          max_target_cards_position = target_cards.sort_by { |card| card.position }.last.position
        else
          max_target_cards_position = -1
        end
        if (max_target_cards_position < ourcard.position)
          sorted_our_cards = our_cards.find_all{|card| card.position > ourcard.position}
          sorted_our_cards.map{|card| card.update(position: card.position - 1)}
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."board_id" = $1  [["board_id", 298486374]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
SELECT "cards".* FROM "cards"
SELECT 1 AS one FROM "cards" WHERE "cards"."board_column_id" = $1 LIMIT $2  [["board_column_id", 298486374], ["LIMIT", 1]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."board_id" = $1 AND "board_columns"."position" = $2  [["board_id", 980190962], ["position", 0]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1 AND "cards"."position" = $2  [["board_column_id", 298486374], ["position", 0]]
UPDATE "cards" SET "position" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["position", 1], ["updated_at", "2022-02-20 09:12:10.469358"], ["id", 1018350795]]

    def destroy
      ourcard = Card.find(params[:id])
      cards = Card.where(board_column_id: ourcard.board_column_id)
      sorted_cards = cards.find_all{ |card| card.position > ourcard.position }
      sorted_cards.map{|card| card.update(position: card.position - 1)}
      ourcard.destroy
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_column_id" = $1  [["board_column_id", 298486374]]
SELECT "board_columns".* FROM "board_columns" WHERE "board_columns"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" ORDER BY "cards"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "cards" SET "title" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["title", "test"], ["updated_at", "2022-02-19 15:44:01.648788"], ["id", 298486374]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 298486374]]